### Terraform Plan

```
Terraform will perform the following actions:

  # aws_ecs_task_definition.service will be created
  + resource "aws_ecs_task_definition" "service" {
      + arn                    = (known after apply)
      + arn_without_revision   = (known after apply)
      + container_definitions  = (known after apply)
      + enable_fault_injection = (known after apply)
      + family                 = "service"
      + id                     = (known after apply)
      + network_mode           = (known after apply)
      + revision               = (known after apply)
      + skip_destroy           = false
      + tags_all               = (known after apply)
      + track_latest           = false

      + ephemeral_storage {
          + size_in_gib = 50
        }
    }

  # aws_iam_role.abatugo_autoscribe_ecs_task_execution_role will be created
  + resource "aws_iam_role" "abatugo_autoscribe_ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "abatugo_autoscribe_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "abatugo_autoscribe_execution_role"
    }
```